#+title: Restclient
#+PROPERTY: header-args:restclient :var api=""
#+STARTUP: hideblocks
#+STARTUP: overview

** GET /users-permissions/permissions
Get default generated permissions

#+begin_src restclient
GET http://localhost:1337/users-permissions/permissions
Content-Type: application/json
Authorization: Bearer :bearer
#+end_src

#+RESULTS:
#+begin_example
{
  "permissions": {
    "api::content-type.content-type": {
      "controllers": {
        "controllerA": {
          "find": {
            "enabled": false,
            "policy": ""
          },
          "findOne": {
            "enabled": false,
            "policy": ""
          },
          "create": {
            "enabled": false,
            "policy": ""
          }
        },
        "controllerB": {
          "find": {
            "enabled": false,
            "policy": ""
          },
          "findOne": {
            "enabled": false,
            "policy": ""
          },
          "create": {
            "enabled": false,
            "policy": ""
          }
        }
      }
    }
  }
}
#+end_example

** GET /users-permissions/roles
List roles

#+begin_src restclient
GET http://localhost:1337/users-permissions/roles
Content-Type: application/json
Authorization: Bearer :bearer
#+end_src

#+RESULTS:
#+begin_example
{
  "roles": [
    {
      "id": 1,
      "name": "Public",
      "description": "Default role given to unauthenticated user.",
      "type": "public",
      "createdAt": "2022-05-19T17:35:35.097Z",
      "updatedAt": "2022-05-31T16:05:36.603Z",
      "nb_users": 0
    }
  ]
}
#+end_example

** GET /users-permissions/roles/{id}
Get a role

#+begin_src restclient :var id="string"
GET http://localhost:1337/users-permissions/roles/:id
Content-Type: application/json
Authorization: Bearer :bearer
#+end_src

#+RESULTS:
#+begin_example
{
  "role": {
    "id": 1,
    "name": "Public",
    "description": "Default role given to unauthenticated user.",
    "type": "public",
    "createdAt": "2022-05-19T17:35:35.097Z",
    "updatedAt": "2022-05-31T16:05:36.603Z",
    "permissions": {
      "api::content-type.content-type": {
        "controllers": {
          "controllerA": {
            "find": {
              "enabled": true
            }
          }
        }
      }
    }
  }
}
#+end_example

** GET /users
Get list of users

#+begin_src restclient
GET http://localhost:1337/users
Content-Type: application/json
Authorization: Bearer :bearer
#+end_src

#+RESULTS:
#+begin_example
[
  {
    "id": 9,
    "username": "foao@strapi.io",
    "email": "foao@strapi.io",
    "provider": "local",
    "confirmed": false,
    "blocked": false,
    "createdAt": "2022-06-01T18:32:35.211Z",
    "updatedAt": "2022-06-01T18:32:35.217Z"
  }
]
#+end_example

** POST /users
Create a user

#+begin_src restclient
POST http://localhost:1337/users
Content-Type: application/json
Authorization: Bearer :bearer

{
  "username": "foo",
  "email": "foo@strapi.io",
  "password": "foo-password"
}
#+end_src

#+RESULTS:
#+begin_example
{
  "id": 1,
  "username": "foo",
  "email": "foo@strapi.io",
  "provider": "local",
  "confirmed": false,
  "blocked": false,
  "createdAt": "2022-05-19T17:35:35.096Z",
  "updatedAt": "2022-05-19T17:35:35.096Z",
  "role": {
    "id": 1,
    "name": "X",
    "description": "Default role given to authenticated user.",
    "type": "authenticated",
    "createdAt": "2022-05-19T17:35:35.096Z",
    "updatedAt": "2022-06-04T07:11:59.551Z"
  }
}
#+end_example

** GET /users/{id}
Get a user

#+begin_src restclient :var id="string"
GET http://localhost:1337/users/:id
Content-Type: application/json
Authorization: Bearer :bearer
#+end_src

#+RESULTS:
#+begin_example
{
  "id": 1,
  "username": "foo",
  "email": "foo@strapi.io",
  "provider": "local",
  "confirmed": false,
  "blocked": false,
  "createdAt": "2022-05-19T17:35:35.096Z",
  "updatedAt": "2022-05-19T17:35:35.096Z"
}
#+end_example

** PUT /users/{id}
Update a user

#+begin_src restclient :var id="string"
PUT http://localhost:1337/users/:id
Content-Type: application/json
Authorization: Bearer :bearer

{
  "username": "foo",
  "email": "foo@strapi.io",
  "password": "foo-password"
}
#+end_src

#+RESULTS:
#+begin_example
{
  "id": 1,
  "username": "foo",
  "email": "foo@strapi.io",
  "provider": "local",
  "confirmed": false,
  "blocked": false,
  "createdAt": "2022-05-19T17:35:35.096Z",
  "updatedAt": "2022-05-19T17:35:35.096Z",
  "role": {
    "id": 1,
    "name": "X",
    "description": "Default role given to authenticated user.",
    "type": "authenticated",
    "createdAt": "2022-05-19T17:35:35.096Z",
    "updatedAt": "2022-06-04T07:11:59.551Z"
  }
}
#+end_example

** DELETE /users/{id}
Delete a user

#+begin_src restclient :var id="string"
DELETE http://localhost:1337/users/:id
Content-Type: application/json
Authorization: Bearer :bearer
#+end_src

#+RESULTS:
#+begin_example
{
  "id": 1,
  "username": "foo",
  "email": "foo@strapi.io",
  "provider": "local",
  "confirmed": false,
  "blocked": false,
  "createdAt": "2022-05-19T17:35:35.096Z",
  "updatedAt": "2022-05-19T17:35:35.096Z"
}
#+end_example

** GET /users/me
Get authenticated user info

#+begin_src restclient
GET http://localhost:1337/users/me
Content-Type: application/json
Authorization: Bearer :bearer
#+end_src

#+RESULTS:
#+begin_example
{
  "id": 1,
  "username": "foo",
  "email": "foo@strapi.io",
  "provider": "local",
  "confirmed": false,
  "blocked": false,
  "createdAt": "2022-05-19T17:35:35.096Z",
  "updatedAt": "2022-05-19T17:35:35.096Z"
}
#+end_example

** GET /users/count
Get user count

#+begin_src restclient
GET http://localhost:1337/users/count
Content-Type: application/json
Authorization: Bearer :bearer
#+end_src

#+RESULTS:
#+begin_example
1
#+end_example
